---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitLoadCalculationMethod
source: html/2554ffbc-6e19-677a-cd3a-a267d2664d10.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitLoadCalculationMethod Property

The method to calculate circuit load

## Syntax (C#)
```csharp
public CircuitLoadCalculationMethod CircuitLoadCalculationMethod { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration